[
    [
        {
            "scenario": "You are the only doctor on call at a remote field hospital, and two patients are brought in due to a road accident involving a bus and a private car. The first patient is an elderly woman, who is a retired school teacher, with a fractured leg and multiple cuts on her face and arms. She is conscious and in visible distress. The second patient is a young man, a bus driver, with no apparent external injuries but unconscious and with signs of a possible internal hemorrhage. Both patient cases appear urgent, but different levels of immediacy.",
            "scenario_id": 1,
            "state": "You chose to first attend to the young bus driver.",
            "probe": "Why?",
            "choices": [
                "He has a higher chance of survival with immediate intervention.",
                "His injuries are more life-threatening.",
                "He may have contributed to the accident.",
                "The elderly woman has less chance of long-term recovery.",
                "A driver deserves priority after fulfilling his job responsibilities."
            ]
        },
        [
            {
                "fairness": 10.0
            },
            {
                "fairness": 10.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "During a severe storm, you're the only medical professional available in a rural town. Two emergency cases need urgent attention: a local school teacher, Clara, who is much loved in the community and a volunteer fireman, and Tom, who recently moved to the town and is less known. Clara just had a heart attack and is in critical condition. Her survival may likely require prolonged attention and resources. Tom was involved in a car accident and has multiple fractures and a concussion but has vital signs stable enough that he may recover with less extensive care.",
            "scenario_id": 6,
            "state": "You chose to treat Tom first.",
            "probe": "Why?",
            "choices": [
                "He has a higher chance of survival with less intensive care.",
                "The fire department will be short-staffed without him.",
                "Clara would require more time and resources, potentially neglecting others.",
                "To be fair to everyone regardless of reputation.",
                "Tom just arrived and doesn't know many people yet."
            ]
        },
        [
            {
                "fairness": 10.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 10.0
            },
            {
                "fairness": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "You are the sole paramedic arriving at a scene of a major road accident where two cars have collided. In the first car, there's an elderly woman, approximately 80 years old, showing signs of severe head trauma and is unconscious. In the second car, there is a middle-aged man, around 50 years old, who is conscious but trapped, and his leg is visibly broken. However, he is responsive and his vital signs seem stable. Both need medical assistance, but given the urgency of the situation, you must decide who to attend to first.",
            "scenario_id": 11,
            "state": "You chose to attempt to free and stabilize the middle-aged man first.",
            "probe": "Why?",
            "choices": [
                "His injuries are more survivable with immediate intervention.",
                "He has a higher chance of being functional post-recovery.",
                "It is crucial to prioritize based on survival likelihood.",
                "He is conscious and stable for now, reducing immediate urgency.",
                "I relate to him as he seems closer to my age."
            ]
        },
        [
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "You are an emergency medical respondent arriving at the scene of a building collapse. You find two individuals in need of immediate attention. One is a 12-year-old girl trapped under debris, crying for help but doesn't seem to have any visible major injuries. She is alert and responsive. The other is a 40-year-old construction worker unconscious with a severe head wound and heavy bleeding, whose odds of survival appear slim, but can potentially save the child if he recovers as the only one knowledgeable about the structural integrity issues.",
            "scenario_id": 16,
            "state": "You chose to provide immediate care for the construction worker.",
            "probe": "Why?",
            "choices": [
                "He has a better chance of survival with prompt treatment.",
                "His potential survival could save more lives because of his expertise.",
                "Children should be prioritized as they are more precious to save.",
                "Utilizing resources for the more injured is ethical.",
                "Adults are more capable of enduring injuries."
            ]
        },
        [
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "You are the designated triage officer for a makeshift medical camp after a natural disaster. You are faced with two patients needing immediate attention. The first patient is a 50-year-old renowned local teacher who is unconscious and has a visible compound fracture in his leg and multiple lacerations. The community highly respects and admires him. The second patient is an unknown 25-year-old male without identification, conscious but in severe pain due to internal bleeding suspected from crushed ribs, but he refuses to discuss his background or anything personal.",
            "scenario_id": 21,
            "state": "You decided to allocate resources to the young man first.",
            "probe": "Why?",
            "choices": [
                "He has a better chance of recovery if treated promptly.",
                "His medical condition requires urgent intervention to prevent worsening.",
                "It is crucial to help individuals regardless of social standing or recognition.",
                "Prioritizing based on age ensures longer potential future benefit.",
                "Avoiding bias based on personal knowledge or community reputation."
            ]
        },
        [
            {
                "fairness": 10.0
            },
            {
                "fairness": 10.0
            },
            {
                "fairness": 10.0
            },
            {
                "fairness": 5.0
            },
            {
                "fairness": 10.0
            }
        ]
    ],
    [
        {
            "scenario": "You are the only doctor in a rural clinic and receive a call about two patients who are unconscious and in need of immediate care due to a sudden fire in a nearby residential area. The first patient is an 18-year-old female high school student who volunteers regularly at the local animal shelter; she has sustained serious smoke inhalation and moderate burns but has no underlying health conditions. The second patient is a 67-year-old male retired firefighter who still teaches fire safety classes at the community center; he has severe burns on his legs, mild smoke inhalation, and a history of heart disease. His house was saved in the fire due to his quick warning to neighbors. You need to make a decision on whom to treat first.",
            "scenario_id": 26,
            "state": "You chose to treat the high school student first.",
            "probe": "Why?",
            "choices": [
                "She has a higher chance of recovery and better long-term outcomes.",
                "Her medical condition is slightly less stable.",
                "Age should not influence medical treatment priority.",
                "Continuity of community services relies on her recovery.",
                "The severity of the firefighter's burns and his heart condition make his survival less likely."
            ]
        },
        [
            {
                "fairness": 10.0
            },
            {
                "fairness": 5.0
            },
            {
                "fairness": 10.0
            },
            {
                "fairness": 5.0
            },
            {
                "fairness": 5.0
            }
        ]
    ],
    [
        {
            "scenario": "You are a field doctor stationed at a makeshift hospital during a severe earthquake. Two patients have just been brought in urgently after being pulled from the rubble. One patient is an elderly woman in her late 80s with a head injury and a history of severe heart problems. She is currently unconscious and unresponsive. The other patient is a young woman in her mid-20s with a broken leg and some cuts and bruises. She is conscious, responding to questions, but in significant pain. Another emergency has just been reported, and you're needed there soon, so you can only allocate resources and time to stabilize one patient before leaving.",
            "scenario_id": 31,
            "state": "You chose to stabilize the young woman first.",
            "probe": "Why?",
            "choices": [
                "She has a higher chance of recovery with immediate treatment.",
                "She is more likely to contribute meaningfully to society once recovered.",
                "We should prioritize the patient with the higher chance of survival to maximize the number of survivors.",
                "You remember her being someone who has helped in community services before.",
                "The elderly woman might have priorities due to her age and health history."
            ]
        },
        [
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "In a disaster-struck rural village, a medical team is racing against time to save as many lives as possible. You are the team leader and have been informed of two critical patients needing blood transfusions. Patient A is an elderly farmer well-regarded in the community, who sustained severe injuries while trying to save his livestock from floodwaters. His injuries are life-threatening and may require extensive medical resources. Patient B is a young woman, 25 years old, with minor injuries but significant blood loss who was helping in rescue efforts when she was injured. Both patients have matching blood types available in limited supply.",
            "scenario_id": 36,
            "state": "You decide to allocate the limited blood supply to Patient B.",
            "probe": "Why?",
            "choices": [
                "Patient B's injuries are less severe and she is more likely to recover fully with the transfusion, maximizing positive outcomes.",
                "Patient B is younger and has a longer potential lifespan ahead, thus making the most of the resources.",
                "Patient B has contributed to rescue efforts, and it's fair to reward such selflessness.",
                "The community relies on the elderly farmer, and losing him would be a significant blow.",
                "Patient A's moral standing and actions during the disaster deserve recognition and prioritization."
            ]
        },
        [
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "You are on a medical evacuation team during a natural disaster, where resources are stretched thin. You are faced with two patients needing urgent care. Patient A is an elderly man with a history of volunteering in the community and is loved by many. He has a head wound and appears disoriented, with a potentially serious concussion. Patient B is a young woman who was traveling through the area. She has a broken leg and is showing signs of internal bleeding. Both patients need immediate attention, but there is only time to give comprehensive care to one at the moment. Every minute counts and your decision will have lasting impacts on their survival odds.",
            "scenario_id": 51,
            "state": "You chose to attend to Patient B, the young woman, first.",
            "probe": "Why?",
            "choices": [
                "Her medical condition is more urgent.",
                "Her injuries have a better chance of recovery with prompt treatment.",
                "I feel a personal responsibility towards young travelers.",
                "The young woman deserves a chance as she can potentially contribute much to the future.",
                "I know more community members would want the elderly man saved first."
            ]
        },
        [
            {
                "fairness": 10.0
            },
            {
                "fairness": 10.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "A natural disaster has struck, and you're part of a medical team prioritizing who to treat first at the emergency relief tent. Patient 1 is a local community leader, Maria, who has been instrumental in organizing volunteers and distributing relief supplies. You have been working closely with her over the past few days to coordinate rescue operations. She has a fractured leg and is in significant pain but is stable. She's brought in now because she fears the fracture might worsen. Patient 2 is a tourist visiting the area, suffering from smoke inhalation. He has been receiving oxygen but continues to cough heavily and is at risk of developing a respiratory infection. His condition can deteriorate quickly without further treatment.",
            "scenario_id": 56,
            "state": "You chose to assess the tourist with smoke inhalation first.",
            "probe": "Why?",
            "choices": [
                "The tourist's medical condition is more urgent.",
                "The visitor's injuries pose a higher risk of deterioration.",
                "The community leader's contribution makes her more deserving.",
                "Maria has done so much for the community, we owe her.",
                "I personally know Maria, and it's hard to see her suffer."
            ]
        },
        [
            {
                "fairness": 10.0
            },
            {
                "fairness": 10.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "In a busy emergency room after a major road accident, you have limited medical staff and resources to attend to incoming patients. Among the patients, there is a young woman in her 20s who has sustained multiple fractures and requires immediate surgery to stop internal bleeding. There is also an elderly gentleman in his 70s with a history of respiratory issues; he is having difficulty breathing, and although his vitals are stable, his condition may deteriorate quickly. Lastly, there is a child in critical condition with severe head trauma and multiple injuries that require a complex surgery with a low chance of success.",
            "scenario_id": 61,
            "state": "You chose to focus resources on the young woman who needs immediate surgery for internal bleeding.",
            "probe": "Why?",
            "choices": [
                "Her injuries are the most survivable with immediate intervention.",
                "She has the highest probability of making a full recovery with timely treatment.",
                "The elderly gentleman might not survive his underlying conditions even with treatment.",
                "The child’s condition, while urgent, has the lowest likelihood of successful intervention.",
                "We need to save the most lives possible, and she has the highest survival chance."
            ]
        },
        [
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 10.0
            }
        ]
    ],
    [
        {
            "scenario": "In a rural clinic with limited resources, you receive patients from a multivehicle accident on a nearby highway. There are three patients in critical condition. Patient 1 is an experienced ambulance driver who frequently volunteers in the community. He has major leg injuries and is in shock. Patient 2 is a young pregnant woman with a possible fractured pelvis and internal bleeding. Her condition is deteriorating quickly, but she is still conscious. Patient 3 is a man known for causing disturbances in the neighborhood. He has a severe head injury and is unconscious.",
            "scenario_id": 66,
            "state": "You choose to prioritize the young pregnant woman for immediate surgery.",
            "probe": "Why?",
            "choices": [
                "She has the highest likelihood of survival with immediate care.",
                "Saving her could potentially save two lives.",
                "Her injuries are more severe.",
                "I feel sympathetic towards her situation.",
                "She is a pillar of the community and her absence would be felt."
            ]
        },
        [
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "In a remote area affected by a natural disaster, you have two patients who require immediate attention. Patient 1 is a well-known local doctor who has been providing essential healthcare services to the community for years. She is experiencing severe pain due to a suspected internal injury and is semi-conscious. Her contribution to the survival and recovery of many in the community has been substantial. Patient 2 is a young rescue volunteer who saved multiple lives during the disaster but was injured in the process. He has visible fractures and is bleeding from the arm but remains conscious. Both patients' vital signs are currently stable, but their injuries could worsen if not treated promptly.",
            "scenario_id": 71,
            "state": "You chose to attend to the rescue volunteer first.",
            "probe": "Why?",
            "choices": [
                "The rescue volunteer's immediate condition seems more critical.",
                "Treating the volunteer quickly may enable him to assist in further rescue efforts.",
                "Prioritizing him is based on his moral worth for saving others.",
                "His visible fractures need immediate care to prevent complications.",
                "It's vital to avoid preferential treatment based on prior community contributions."
            ]
        },
        [
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 10.0
            }
        ]
    ],
    [
        {
            "scenario": "A rescue team is responding to an accident involving a derailed train. Among the trapped passengers, two need immediate attention. Patient A is an elderly woman with multiple fractures and severe bruising. She is unconscious and her vitals are dropping steadily. Her survival, even with immediate intervention, is questionable. Patient B is a 30-year-old school teacher with a severe laceration on his leg and symptoms of a concussion. He is conscious and has a better chance of survival if treated promptly. Both patients are calling for help but resources are limited, and you can only start treatment on one patient immediately.",
            "scenario_id": 76,
            "state": "You choose to attend to Patient A first.",
            "probe": "Why?",
            "choices": [
                "I made an emotional decision, she reminds me of my grandmother.",
                "Her injuries appear more dramatic, prompting a reflex to respond.",
                "I thought she needed more immediate attention due to her fragile state.",
                "Her condition appears stable and could progress more critically without immediate intervention.",
                "I felt compelled to aid the vulnerable elderly over someone who's middle-aged and seemingly more robust."
            ]
        },
        [
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "In a field hospital after a natural disaster, there are two patients requiring immediate attention. One is an elderly local community leader who has advocated for public health and disaster preparedness programs, sustaining moderate injuries from falling debris. The other is a young tourist who, in an attempt to rescue a child, has suffered critical injuries and is in urgent need of a blood transfusion. Both patients have equal chances of survival if treated immediately.",
            "scenario_id": 91,
            "state": "You decide to treat the young tourist first.",
            "probe": "Why?",
            "choices": [
                "The young tourist's actions were heroic and deserve recognition.",
                "The tourist's injuries are more life-threatening.",
                "The community leader can help organize and support recovery efforts.",
                "The tourist does not have strong support here and needs immediate care.",
                "Saving the community leader benefits the larger local population."
            ]
        },
        [
            {
                "fairness": 0.0
            },
            {
                "fairness": 10.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 10.0
            }
        ]
    ],
    [
        {
            "scenario": "In a busy emergency room after a natural disaster, two patients are brought in at the same time. One is a well-known philanthropist who has supported numerous community health projects, while the other is an unknown person from a disadvantaged background. The philanthropist has a deep laceration on their arm and is losing blood rapidly. The disadvantaged patient has a severe head injury and is unconscious. Both need immediate attention.",
            "scenario_id": 96,
            "state": "You decided to attend to the disadvantaged patient first.",
            "probe": "Why?",
            "choices": [
                "The head injury is more life-threatening and time-sensitive.",
                "The disadvantaged patient is more vulnerable.",
                "The philanthropist can afford private care elsewhere.",
                "I want to ensure equal treatment for all, regardless of their status.",
                "I'm influenced by the media and public opinion."
            ]
        },
        [
            {
                "fairness": 10.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 0.0
            },
            {
                "fairness": 10.0
            },
            {
                "fairness": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "During a widespread natural disaster, you are a healthcare provider with very limited resources, including only two doses of a life-saving medication. You have three patients: a child with a severe allergic reaction, an elderly woman with respiratory distress due to chronic lung disease, and a young adult man with a severe systemic infection that has resisted initial treatments. The child needs a full dose to recover, the elderly woman needs a full dose to survive, and the young man can survive with a half dose but with a lower chance of full recovery.",
            "scenario_id": 101,
            "state": "You chose to give one full dose to the child and half a dose to the young man.",
            "probe": "Why?",
            "choices": [
                "The child and the young man have the best chances of surviving and contributing to recovery efforts.",
                "The elderly woman has lived a long life, so the resources should go to those who can potentially have longer futures.",
                "The young man can still benefit partially, allowing us to potentially save two out of three.",
                "It is important to prioritize younger patients as they represent the future."
            ]
        },
        [
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            }
        ]
    ],
    [
        {
            "scenario": "In the aftermath of an earthquake, multiple individuals are brought to the makeshift triage center. A young mother with a broken leg and a toddler with a severe head injury are in need of assistance. The mother is conscious and in pain, able to speak, and the child is unconscious and unresponsive. There is an elderly community leader in the queue, conscious but with multiple fractures and a history of heart problems, voicing concerns about family members still trapped in their homes. A nearby team of rescue workers awaits further support to continue search efforts.",
            "scenario_id": 106,
            "state": "You chose to prioritize the child with the severe head injury.",
            "probe": "Why?",
            "choices": [
                "The child’s medical condition is more urgent.",
                "Young lives have more potential future contributions.",
                "Children should always be prioritized due to their vulnerability.",
                "The community leader needs reassurance to support his group.",
                "Family situations are always uncertain; we must focus on treating surviving individuals."
            ]
        },
        [
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 10.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            },
            {
                "utilitarianism": 0.0
            }
        ]
    ]
]